const button = document.getElementById("button");
const toast = document.getElementById("toast");

const masseges = [
  "كم قمر في الكون؟ اثنين واحد في السماء وواحد قاعد يقرأ الرسالة",
  "قد يبيع الإنسان شيئا قد شراه…ولكن لايبيع قلبا قد هواه",
  "انحبك",
  "عندما نقع في الحب، لا نختار من نحبه، لكن القدر يقودنا إلى من نحبه",
  "أحبك بكل ما أملك من مشاعر الحب",
  "حبك ووجودك يساوي ما فقدته في هذه الحياة",
  "أنت النبض الذي ينعشني كل يوم",
  "المشاعر الجميلة والحياة السعيدة لا يمكن أن تكون إلا مع شخص واحد مثلك",
  "احلم بك",
  "أنت تجعل قلبي يبتسم",
  "إنّ في حضور عينيك تتلاشى الوجوه، ",
  "يا أحلى ما في الكون",
  "صوتك حياة",
  "لقاؤك عمر ثاني",
  "مالي أراك في كل الوجوه أغزوت عيني أم غزتك الأماكن ",
  "عيناك لهما سحر خاص لا استطيع مقاومته",
  "لا يوجد نور اكبر من النور الذي اعطيتني في حياتي",
  "عيناك كوكبان وانا قمر ادور حولهما",
  "كل شي فيا انت نصفه الثاني الا قلبي انت كله",
  " يلتفت قلبي اليك كل مرا و كانها اول مرا",
  "كيف اتوب عن عينيك وانا في غرامك ابتليت ",
  "وكأن الزمن توقف في عينيك ",
  "انت جميع ما أميل اليه ",
  "ياورد عمري وحب سنيني",
  "انا لم اقع بحبك انا وقعت داخلك",
  "بيننا ورد واغصان ومدينه وحب",
];

button.addEventListener("click", () => creatNotification());

function creatNotification() {
  const notif = document.createElement("div");
  notif.classList.add("toast");

  notif.innerText = getRandomMessage();
  toast.appendChild(notif);

  setTimeout(() => {
    notif.remove();
  }, 4000);
}

function getRandomMessage() {
  return masseges[Math.floor(Math.random() * masseges.length)];
}
